export function createCubeVertices() {
  // prettier-ignore
  const positionData = new Float32Array([
     // 前面   
    -1,  1,  1,
    -1, -1,  1,
     1,  1,  1,
     1, -1,  1,
     // 右面   
     1,  1, -1,
     1,  1,  1,
     1, -1, -1,
     1, -1,  1,
     // 背面   
     1,  1, -1,
     1, -1, -1,
    -1,  1, -1,
    -1, -1, -1,
    // 左面    
    -1,  1,  1,
    -1,  1, -1,
    -1, -1,  1,
    -1, -1, -1,
    // 底面    
     1, -1,  1,
    -1, -1,  1,
     1, -1, -1,
    -1, -1, -1,
    // 上面    
    -1,  1,  1,
     1,  1,  1,
    -1,  1, -1,
     1,  1, -1,
  ])

  // prettier-ignore
  const texcoordData = new Float32Array([
    // 左上の画像を選択
    0   , 0  ,
    0   , 0.5,
    0.25, 0  ,
    0.25, 0.5,
    // 中央上の画像を選択
    0.25, 0  ,
    0.5 , 0  ,
    0.25, 0.5,
    0.5 , 0.5,
    //  右上の画像を選択
    0.5 , 0  ,
    0.5 , 0.5,
    0.75, 0  ,
    0.75, 0.5,
    //  左下の画像を選択
    0   , 0.5,
    0.25, 0.5,
    0   , 1  ,
    0.25, 1  ,
    // 中央下の画像を選択
    0.25, 0.5,
    0.5 , 0.5,
    0.25, 1  ,
    0.5 , 1  ,
    // 右下の画像を選択
    0.5 , 0.5,
    0.75, 0.5,
    0.5 , 1  ,
    0.75, 1  ,
  ])

  // prettier-ignore
  const indexData = new Uint16Array([
     0,  1,  2,  2,  1,  3,  // 前
     4,  5,  6,  6,  5,  7,  // 右
     8,  9, 10, 10,  9, 11,  // 後
    12, 13, 14, 14, 13, 15,  // 左
    16, 17, 18, 18, 17, 19,  // 下
    20, 21, 22, 22, 21, 23,  // 上
  ])

  return {
    positionData,
    texcoordData,
    indexData,
    numVertices: indexData.length,
  }
}
